Repository: Arachnacein/App
Catalog: UI/Resources/Pages/Index.*.resx
Languages: pl

source: Architecture
pl: Architektura

# architecture_1st
source: The architecture used in this application is based on Clean Architecture, which has become the standard for writing WebAPIs. It involves separating business logic from databases and user interfaces. This creates a layered structure where each layer communicates with the others in a defined way.
pl: Architektura użyta w tej aplikacji opiera się na Clean Architecture, która stała się standardem przy tworzeniu WebAPI. Polega ona na oddzieleniu logiki biznesowej od baz danych i interfejsów użytkownika. Tworzy to warstwową strukturę, w której każda warstwa komunikuje się z pozostałymi w określony sposób.

# architecture_2nd
source: Additionally, the application is built using a distributed architecture, specifically microservices. It is divided into modules, such as the API responsible for business logic related to transactions and budgeting, and the graphical user interface. These modules are connected by an API Gateway, which routes requests between the modules.
pl: Dodatkowo aplikacja jest zbudowana w oparciu o architekturę rozproszoną, a dokładniej mikroserwisy. Jest podzielona na moduły, takie jak API odpowiedzialne za logikę biznesową związaną z transakcjami i budżetowaniem oraz graficzny interfejs użytkownika. Moduły te są połączone za pomocą API Gateway, który przekierowuje żądania między modułami.

# Item1Description
source: Application will help you control your expenses and save money.
pl: Aplikacja pomoże Ci kontrolować wydatki i dzięi temu oszczędzać pieniądze.

# Item1Header
source: Welcome in budget App!
pl: Witaj w aplikacji do zarządzania budżetem!

# Item2ActionText
source: Learn more about Blazor
pl: Dowiedz się więcej o Blazor.

# Item2Description
source: System will automatically divide them according to the given pattern.
pl: System automatycznie podzieli je zgodnie z określonym wzorem.

# Item2Header
source: You can add your monthly incomes and expenses.
pl: Tu możesz dodawać swoje miesięczne dochody i wydatki.

# Item3ActionText
source: Learn about managing budget
pl: Dowiedz się więcej o pieniądzach i szczędzaniu

# Item3Description
source: There are monthly, yearly and other unconventional statistics. e.g. On which days do you do more shopping? Even or odd?
pl: Dostępne są statystyki miesięczne, roczne oraz inne nietypowe statystyki, np. W które dni robisz więcej zakupów? Parzyste czy nieparzyste?

# Item3Header
source: You can check your budget statistics.
pl: W aplikacji możesz sprawdzać statystyki swojego budżetu.

# Item4Description
source: You set the expense as a deposit and link it to a goal, and the app continuously analyzes and displays your progress towards achieving the goal.
pl: Możeszdodać wydatek jako wpłatę i złączyć ją z celem, a aplikacja na bieżąco przeanalizuje i wyświetli Twój postęp w osiąganiu celu.

# Item4Header
source: With this app you can create goals for which you save money.
pl: Dzięki tej aplikacji możesz tworzyć cele, na które oszczędzasz pieniądze.

source: Motivation
pl: Motywacja

# motivation_1st
source: Since I started working, I noticed that it’s worth dividing income into specific categories. I divided them into savings, daily expenses, and those related to entertainment. This allowed for clear budget management, and the savings generated helped build a financial safety net. In the beginning, I would write this down on paper. In fact, long before I started working, I would note my expenses on sheets of paper, which often got lost. That's why I decided to switch to electronic record-keeping. I chose Excel spreadsheets for this. However, I didn't really like it due to its clunky appearance and lack of functionalities I wanted.
pl: Od kiedy zacząłem pracować, zauważyłem, że warto dzielić dochody na konkretne kategorie. Podzieliłem je na oszczędności, codzienne wydatki oraz te związane z rozrywką. Dzięki temu możliwe było jasne zarządzanie budżetem, a wygenerowane oszczędności pomogły zbudować finansową poduszkę bezpieczeństwa. Na początku zapisywałem to na kartkach papieru. W rzeczywistości, jeszcze przed rozpoczęciem pracy, notowałem swoje wydatki na kartkach, które często się gubiły. Dlatego postanowiłem przejść na elektroniczny sposób zapisu. Wybrałem do tego arkusze Excela. Jednak ten sposób niezbyt mi odpowiadał ze względu na mało przejrzysty wygląd i brak funkcjonalności, których potrzebowałem.

# motivation_2nd
source: In the meantime, I decided to start designing my own application. It was supposed to automate processes that I previously had to calculate and managed manually. Additionally, I wanted it to be simple to use and have the functionalities I required. The great thing is that I can design and implement features myself. Without much hesitation, I began creating this application.
pl: W międzyczasie postanowiłem zacząć projektować własną aplikację. Miała ona zautomatyzować procesy, które wcześniej musiałem obliczać i zarządzać ręcznie. Dodatkowo chciałem, żeby była prosta w obsłudze i miała funkcje, których potrzebowałem. Najlepsze jest to, że mogę sam zaprojektować i wdrożyć potrzebne funkcjonalności. Bez większych wahań przystąpiłem do tworzenia tej aplikacji.

# Title
source: Home
pl: Strona główna

# ToolsFrameworks
source: Tools and frameworks
pl: Narzędzia i biblioteki
